OpenFOAM-6-AP/tutorials/combustion/coldEngineFoam/freePiston/0/include/caseSettings
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  6
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      caseSettings;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

internalField
{
    U               (0 0 0);
    epsilon         5.70e-5;
    k               2.40e-5;
    T               350;
    p               1e5;
}

#include "boundaryConditions"

// ************************************************************************* //
